Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Secretary Out-of-Order.tmx
Source language: en
Languages: es_419

source: ending 2 scandal maker
es_419: Final 2 El escándalo

source: - episode 07 -
es_419: - episodio 07 -

source: the blood has dried up.
es_419: Se te secó la sangre.

source: r-really? hehe...
es_419: ¿E-en serio? Je, je…

source: ...through generation after generation?
es_419: … una generación tras otra?

source: but I'm sure he remembers…
es_419: Pero seguro que se acuerda…

source: "that's what happened"? do you think that's convincing?
es_419: ¿"Eso pasó"? ¿Te parece convincente?

source: I shouldn't have taken the morning off.
es_419: No debí haberme tomado la mañana.

source: it can cause various heart diseases and high blood pressure. you have to eat plenty of balanced and good food…
es_419: Eso puede provocar presión alta y diversos problemas cardíacos. Debes comer lo suficiente y equilibrado…

source: I hate you when I think about what you had put me through...
es_419: Cuando pienso en todo lo que me hizo pasar, lo detesto…

source: so I just assumed he was well-off.
es_419: Di por sentado que él tenía dinero.

source: is work too stressful?
es_419: ¿El trabajo te estresa?

source: why is he being so considerate all of a sudden?
es_419: ¿Por qué de pronto es tan amable?

source: - episode 25 -
es_419: - episodio 25 -

source: morning lunch
es_419: MAÑANA ALMUERZO

source: she really was.
es_419: Sí, lo era.

source: ...makes me want to work here until I die!
es_419: … ¡me dan ganas de trabajar hasta morir!

source: no! that can't happen!
es_419: ¡No, no puede ocurrir!

source: it was the best I could think of...
es_419: Fue lo mejor que se me ocurrió…

source: it's chae, not choi.
es_419: Es Chae, no Choi.

source: Sir...
es_419: Señor…

source: my mom's a good judge of people. it's just that he's not my type, that's all.
es_419: Mi mamá capta enseguida cómo es la gente. Lo que pasa es que él no es mi tipo.

source: g-good morning, sir.
es_419: B-buen día, señor.

source: The two of them would probably be...
es_419: Ellos dos deben estar…

source: are you hurt?
es_419: ¿Te lastimaste?

source: DASH
es_419: CORRE

source: oh, this is--
es_419: Ah, es…

source: I should get going…
es_419: Mejor me voy…

source: I heard mr. chae was adopted as a kid by his mother's side of the family after finishing his studies overseas.
es_419: oí que al señor Chae lo adoptó su familia materna cuando era un niño, luego de completar sus estudios en el extranjero.

source: how about being five minutes late?
es_419: ¿Y si llegas cinco minutos tarde?

source: I'm grateful that I met her.
es_419: Agradezco haberla conocido.

source: I don't know.
es_419: No sé.

source: turns out, his home wasn't really a home.
es_419: Al final, resulta que su casa no era una casa.

source: waaah
es_419: ninuu

source: I-I can wipe it myself.
es_419: L-la puedo limpiar yo.

source: you know, a drink is all it takes for someone to open their hearts--
es_419: Te lo digo, solo hace falta un trago para que alguien se sincere…

source: I'm sorry I didn't mention in earlier.
es_419: Perdón por no mencionarlo antes.

source: it's better this way!
es_419: ¡Es mejor así!

source: lecture on basic real estate
es_419: Bases del mercado inmobiliario

source: you told me about the lottery last time.
es_419: Ya me habías dicho lo de la lotería…

source: I got drunk and crossed the line with my boss.
es_419: Me embriagué y me pasé de la raya con mi jefe.

source: t-the chairman?
es_419: ¿E-el presidente?

source: sorry for over-sharing earlier.
es_419: Perdón por lo que dije.

source: ah, yes. it's here.
es_419: Ah, sí. Es aquí.

source: who knew he could be this sweet?
es_419: ¿Cómo saber que podía ser tan dulce?

source: - episode 28 -
es_419: - episodio 28 -

source: yes! it's driving me crazy.
es_419: ¡Sí! Me está volviendo loca.

source: employ of iren t***** product planning MD october
es_419: trabajó en IREN / t***** / gerencia de planificación de producto / octubre

source: I won...
es_419: Gané…

source: I didn't like food that came sealed in bags, delivery meals and microwave dinners.
es_419: No me gustaba la comida sellada en bolsas o de microondas, ni pedir a domicilio.

source: when did you...
es_419: ¿Cuándo…?

source: SAD
es_419: triste

source: but why?
es_419: ¿Por qué?

source: now that you're leaving.
es_419: ahora que te vas.

source: yikes...
es_419: Cielos…

source: I brought my car, so we can go somewhere far.
es_419: Vine con el auto, podemos ir lejos.

source: d-dohyeok? what is it?
es_419: ¿D-Dohyeok? ¿Qué pasa?

source: huh? ms. gam?
es_419: ¿Eh? ¿A ella?

source: job application form
es_419: Formulario de solicitud de empleo

source: I should inform her, first!
es_419: ¡Primero debería informarle!

source: BEAUTY the secret behind his clean skin that men strive for his being workaholic!
es_419: BELLEZA ¡El secreto de este adicto al trabajo y su piel suave que todo hombre desea!

source: four weeks to recover.
es_419: semanas en recuperarse.

source: you didn’t forget that I was visiting today...
es_419: No te habrás olvidado de que te visitaba hoy…

source: ahhhhh!
es_419: ¡Aaah!

source: his words really struck a chord.
es_419: Sus palabras me afectaron mucho.

source: she was here to work--
es_419: Vino para trabajar…

source: I should make her work in my office for the time being.
es_419: Por ahora será mejor que la haga trabajar en mi oficina.

source: bon appetit.
es_419: Buen provecho.

source: mr. chae.
es_419: Señor Chae.

source: newcompanyvvvwv
es_419: empresaneuvavvvwv

source: where do you live?
es_419: ¿Dónde vives?

source: whew…
es_419: Fiu…

source: I'll hand one to mr. ju once you check.
es_419: Se la daré al señor Ju cuando usted la apruebe.

source: softly
es_419: SUAVE

source: hum
es_419: TURU

source: I could say those things too!
es_419: ¡Yo también podía decirte eso!

source: Why do you always have to act like some heroine in a third-rate K-drama!
es_419: ¡¿Por qué siempre tienes que hacerte la heroína de una novelucha de mala muerte?!

source: trial examination
es_419: Examen de prueba

source: it's like I'm at a restaurant!
es_419: ¡Como si fuera de restaurante!

source: embarrassed all of a sudden
es_419: De pronto le dio vergüenza

source: I need to make it last.
es_419: Debo hacerlo durar.

source: how is a major corporation so inefficient?
es_419: ¿Cómo puede semejante empresa ser tan ineficiente?

source: deja vu
es_419: déjà vu

source: bringing home a girl that he likes.
es_419: trae a casa a la chica que le gusta.

source: i-it's…!
es_419: ¡E-es…!

source: there's something off about ms. gam.
es_419: A la señorita Gam le pasa algo.

source: thursday
es_419: jueves

source: I've always lived my life around other people's schedules.
es_419: Siempre viví atada a la agenda de otras personas.

source: who--
es_419: ¡¿Quién…

source: you don't? then are you expecting...
es_419: Ah, ¿no? ¿Entonces va a tener?

source: I'm getting nauseous again from all this nervousness.
es_419: Con tantos nervios, me están dando náuseas de nuevo.

source: - episode 14 -
es_419: - episodio 14 -

source: I'm okay now!
es_419: ¡Ya estoy bien!

source: looks like everyone has a place to go back to.
es_419: Parece que todo el mundo tiene a dónde volver.

source: ...to be honest, I'm worried about you.
es_419: … seré sincera: me preocupas.

source: du
es_419: cha

source: as a ceo, I had to work hard to pay your salary!
es_419: Era el CEO, ¡tenía que esforzarme para poder pagarte!

source: haha...
es_419: Ja, ja…

source: does he mean something like that?
es_419: ¿Se refiere a algo así?

source: SPARKLE
es_419: TILÍN

source: so I hope you'll make an effort as well.
es_419: Espero que tú también te esfuerces más.

source: we should go.
es_419: Vámonos.

source: how to properly discipline a child out-of-order
es_419: Cómo disciplinar a un niño descarriado

source: hyorin, I told uncle. can you walk our dog?
es_419: Hyorin, le dije al tío. Sacas a pasear al perro?

source: it would have been like any other awkward occasion, but...
es_419: Podría haber sido una situación incómoda como cualquiera, pero…

source: Giving dating advice is not my thing, but…
es_419: No acostumbro a dar consejos románticos, pero…

source: are you okay? do you want me to come with you?
es_419: ¿Estás bien? ¿Quieres que te acompañe?

source: I should ask her why.
es_419: Le preguntaré por qué.

source: h-how do I look?
es_419: ¿Qu-qué tal estoy?

source: I feel much better about leaving thanks to you.
es_419: Gracias a ustedes, no me siento tan mal por irme.

source: as I failed to cheer myself up...
es_419: Como no lograba levantarme el ánimo…

source: are you that sad that I'm leaving?
es_419: ¿Está triste porque me voy?

source: creak
es_419: ÑIIIC

source: I did tell you last time…
es_419: Te lo conté la otra vez…

source: then let me cancel that--
es_419: Entonces mejor lo cancelo…

source: don't you remember?
es_419: ¿No te acuerdas?

source: how have you been?
es_419: ¿Cómo has estado?

source: you get prettier every day!
es_419: ¡Estás cada día más linda!

source: ...I peeked to see what nonsense was in it this time.
es_419: … la espié, para ver qué tonterías dijo esta vez.

source: many doubted his abilities as a young ceo...
es_419: Muchos dudaron de sus capacidades como joven CEO…

source: clap clap clap clap
es_419: PLAS PLAS PLAS PLAS

source: when did we…
es_419: ¿Cuándo…?

source: it's an hour by taxi from home to the office and 15 minutes on foot from the office to his place.
es_419: Es una hora en taxi de casa a la oficina, y 15 minutos a pie de la oficina a la casa de él.

source: I guess this is the last time we see Yu-eun...
es_419: Supongo que ya no volveremos a ver a Yu-eun…

source: da dum
es_419: CHA CHAN

source: well, pretty much...
es_419: Pues, algo así…

source: ...why couldn't you have a slightly less impressive background?
es_419: … ¿por qué no podía tener un entorno un poquito menos impresionante?

source: hehe
es_419: JEJE

source: I haven't started anything but I feel guilty already.
es_419: Aún no hice nada, y ya me siento culpable.

source: ...why does it sound so suffocating now?
es_419: … ¿por qué oírlo ahora me sofoca?

source: ...I've ended up in Jeju island...
es_419: … terminé en la isla Jeju…

source: a book
es_419: Lo que

source: what's more...
es_419: Para colmo…

source: period
es_419: Período

source: o-okay.
es_419: B-bueno.

source: pardon me, sir?
es_419: ¿Cómo dijo, señor?

source: *do you have time?
es_419: *tienes tiempo?

source: department position name last day of work reason for retirement
es_419: Departamento Puesto Nombre Último día de trabajo Motivo de renuncia

source: just his face! there's more to talk about.
es_419: ¡Solo la cara! Hay más de qué hablar.

source: he looks much worse that I thought!!!
es_419: ¡¡Está mucho peor de lo que pensé!!

source: how did I become a secretary in the first place?
es_419: ¿cómo terminé siendo secretaria?

source: um, well…
es_419: Eh, bueno…

source: then one day.
es_419: Hasta que un día…

source: stride
es_419: ZANCADA

source: th-that's…!
es_419: Ah, ¡eso!

source: I just wanted to say that it requires a lot of courage to start something new.
es_419: Solo quería decir que hace falta mucho valor para empezar de cero.

source: let's call it a day.
es_419: Acabemos por hoy.

source: I'd like a sandwich with cucumbers instead of pickles.
es_419: Quiero un sándwich con pepino, en vez de pepinillos.

source: I did when it came to work. but it's not so easy when it comes to my life.
es_419: Sí, cuando se trataba del trabajo. Pero no es tan fácil si se trata de mi vida.

source: woohoo!
es_419: ¡Fi-fiiu!

source: ...a place that's always there for me to return to.
es_419: … un lugar seguro al que siempre puedo volver.

source: relieved
es_419: aliviada

source: oh, what's going on between you two?
es_419: Uh, ¿qué ocurre entre tú y ella?

source: ring
es_419: TLIN

source: so what? you've got to learn to spend one way or another. you'll get used to it.
es_419: ¿Y qué? En algún momento tendrás que aprender a gastar. Ya te vas a acostumbrar.

source: sorry, we’re out of the custard cream ones.
es_419: Lo siento, no quedan más de crema.

source: calm down there, heart!
es_419: ¡Cálmate, corazón!

source: n-no, sir...
es_419: N-no, señor…

source: memories of the wasteful night.
es_419: Recuerdos de la noche de excesos.

source: good morning, sir!
es_419: ¡Buen día, señor!

source: although I can say this now only because I'm leaving.
es_419: Aunque pueda decirlo ahora solo porque me iré.

source: I have 1.6 billion* won.
es_419: Tengo 1600 millones de wones*.

source: but this is too much!
es_419: ¡Pero es demasiado!

source: thank you for dinner!
es_419: ¡Gracias por la cena!

source: this wasn't what I wanted.
es_419: No quería que pasara esto.

source: what's up with the strange questions?
es_419: ¿A qué vienen estas preguntas raras?

source: can I see them?
es_419: ¿Las puedo ver?

source: The workshop usually takes place at Yangpyeong, at the chairmans vacation home.
es_419: En general el taller se hace en Yangpyeong, en la casa de veraneo del presidente.

source: we managed to achieve equal partnership.
es_419: logramos trabajar a la par.

source: um... is that what you got from that?
es_419: Eh… ¿Eso es lo que entendiste tú?

source: you don't like it?
es_419: ¿No te gusta?

source: he and I are from different worlds.
es_419: Somos de mundos distintos.

source: because you probably won't leave me...
es_419: Porque seguro no me dejarás…

source: instant reply
es_419: Respuesta instantánea

source: allow me.
es_419: Yo lo haré.

source: although you might not be…
es_419: Aunque quizás para ti no…

source: ...the position naturally fell to me, and I became dohyeok's head secretary.
es_419: … con el tiempo terminé en ese puesto, y quedé como secretaria de Dohyeok.

source: cheers!
es_419: ¡Salud!

source: that's why I don't like cucumbers.
es_419: Me pasa lo mismo con el pepino.

source: secretary
es_419: secretaria

source: this is dohyeok you’re talking about!
es_419: ¡Es Dohyeok, no cualquier hombre!

source: he just happened to be the person who jumped over them, that's all.
es_419: Él solo fue la persona que logró sortearlas, nada más.

source: hyorin's father...
es_419: El padre de Hyorin…

source: I think this one's better.
es_419: Creo que es mejor este.

source: - episode 16 -
es_419: - episodio 16 -

source: sir, this is yu-eun.
es_419: Señor, soy Yu-eun.

source: …but don't you think he's somewhat different?
es_419: … pero ¿no te parece que está un poco cambiado?

source: and once he finds out, you can use that to finish him off.
es_419: Y, cuando se entere, puedes usarla para acabar con él.

source: even if I waste 5 years, I'll be in my early 30s.
es_419: Y aunque pierda 5 años, tendré menos de 35.

source: it's good! things are falling into place both with work and outside of work.
es_419: ¡Está bien! Están encajando todas las piezas, tanto a nivel laboral como personal.

source: …I couldn't cook like mom.
es_419: … no sabía cocinar como mamá.

source: oh, come on…
es_419: Ay, vamos…

source: quiet
es_419: SILENCIO

source: why is…
es_419: ¿Por qué…?

source: ...cold enough that she needs to wrap herself in a blanket.
es_419: … tanto como para que tuviera que taparse con una manta.

source: my mom overdone herself.
es_419: Mamá se excedió.

source: I'll get you a taxi--
es_419: Te pediré un taxi…

source: Why do you sleep so late?
es_419: ¿Por qué te acuestas tan tarde?

source: okay, if that's what you want…
es_419: Bueno, si tú quieres…

source: and hardly any of them got established.
es_419: y casi nadie logró estabilizarse.

source: it's cringe- worthy…
es_419: Da vergüenza ajena…

source: calm down…
es_419: Cálmate…

source: once I said I was quitting, he kept trying to talk to me.
es_419: Cuando dije que iba a renunciar, me empezó a poner conversación.

source: go, me!
es_419: ¡Bien por mí!

source: this way, please.
es_419: Por aquí, por favor.

source: you might be able to catch his weakness while digging for more information.
es_419: Quizás al buscar más información termines descubriendo cuál es su debilidad.

source: Art by QuornQuorn
es_419: Arte de QuornQuorn

source: it's no wonder she broke down.
es_419: Con razón quedó fuera de servicio.

source: everything's fine. you're dismissed.
es_419: Está todo bien. Puedes irte.

source: we just kissed…
es_419: Solo nos besamos…

source: come on, you can tell me.
es_419: Vamos, me puedes contar.

source: the chae family tree in her head.jpg
es_419: árbol genealógico Chae en su mente.jpg

source: yu-eun, are you okay?
es_419: ¿Estás bien, Yu-eun?

source: yes, thank you.
es_419: Sí, gracias.

source: I'm so relieved!
es_419: ¡Qué gran alivio!

source: what brings you here this late?
es_419: ¿Qué haces aquí tan tarde?

source: I forgot to call the taxi.
es_419: Me olvidé de pedir el taxi.

source: then I'll pig out and--
es_419: Luego comeré como cerda y…

source: I-I apologize, sir.
es_419: D-disculpe, señor.

source: I'm sorry for everything.
es_419: Lamento todo lo que pasó.

source: please have it done by tomorrow morning.
es_419: Hazlo para mañana a primera hora.

source: so I don't hate you or resent you anymore.
es_419: Así que no lo odio, ni estoy resentida.

source: ...that expands their business...
es_419: … que expande sus negocios…

source: that didn't even make a dent in my bank account!
es_419: ¡No afectó en nada a mi cuenta bancaria!

source: nice to meet you, mr. chae.
es_419: Gusto en conocerlo, señor Chae.

source: you can count on me, sir!
es_419: ¡Cuente conmigo, señor!

source: well, I won't make you stay late anymore, so get to bed earlier, ms. gam.
es_419: Bueno, ya no te haré trabajar hasta tarde, así podrás acostarte más temprano.

source: well, first!
es_419: Bien, ¡primero!

source: how could I not get worn out...
es_419: ¿Cómo no me iba a agotar…

source: Puff
es_419: BUFF

source: oh. you mean the sandwich, right?
es_419: Ah. ¿Lo dice por lo del sándwich?

source: I have five rooms.
es_419: Tengo cinco cuartos.

source: I'm here to see my old friend...
es_419: Vine a ver a mi viejo amigo…

source: that will never happen again.
es_419: No volverá a ocurrir nunca.

source: [news] ceo of iren injured
es_419: [NOTICIAS] CEO de IREN

source: what's gotten into him?
es_419: ¿Qué bicho le picó?

source: was it ms. kang?
es_419: ¿Era señorita Kang?

source: NOT BUSY
es_419: DESOCUPADA

source: I’ll pretend to be asleep for now.
es_419: Por ahora fingiré estar dormida.

source: he's here!
es_419: ¡Llegó!

source: ...wasn't wrong.
es_419: … no estaba errado.

source: that will be great haha.
es_419: Buenísimo, ja, ja.

source: They say you can't teach an old dog new tricks.
es_419: Dicen que el hombre es un animal de costumbres.

source: yeah, I'm fine…
es_419: Sí, estoy bien…

source: I really wanted to let you work from home, but...
es_419: Quería que trabajaras desde casa, en serio, pero…

source: then let me apologize.
es_419: Déjame disculparme.

source: you wouldn't have been like this...
es_419: Usted no habría hecho esto…

source: th…
es_419: Eh…

source: dumbfounded
es_419: ESTUPEFACTO

source: chairman chae
es_419: Presidente Chae

source: most desired
es_419: el yerno más

source: home
es_419: casa

source: every
es_419: todo

source: assault and battery
es_419: Ataque y agresión

source: my parent's business...
es_419: El negocio de mis padres…

source: kyaa!
es_419: ¡Aiaa!

source: reason for signation
es_419: motivo de renuncia

source: so--
es_419: Y…

source: it's all because that friend of his showed up!
es_419: ¡Y todo porque apareció su amigo!

source: now that I think about it...
es_419: Ahora que lo pienso…

source: That's why...
es_419: Por eso…

source: examination
es_419: Examen

source: is it spring already?
es_419: ¿Ya es primavera?

source: I'm worried.
es_419: Me preocupas.

source: I lost the people I thought I'd spend all of my life with...
es_419: Perdí a personas que pensé que me acompañarían toda la vida…

source: it fell...
es_419: Bajó…

source: okay…
es_419: Bueno…

source: it's fun.
es_419: Es divertido.

source: yu-eun, do you hav tim
es_419: Yu-eun, tienes time

source: you're going to pyeonghyang, right?
es_419: Va a Pyeonghyang, ¿cierto?

source: rewind
es_419: REBOBINA

source: you talked behind my…
es_419: ¿Qué cosas le dijiste de…?

source: the coffee and sandwich were just the beginning...
es_419: El café y el sándwich fueron solo el comienzo…

source: ugh. stop being so lame.
es_419: Uff. Basta de ser tan débil.

source: I'm young and rich.
es_419: Soy joven y rica.

source: ack!
es_419: ¡Ay!

source: so, please...
es_419: Por favor…

source: language
es_419: Idioma

source: sorry for troubling you. then I’ll be on my--
es_419: Lamento incomodarlo. Bien, mejor me v…

source: that's because you make me work overtime!
es_419: ¡Porque usted me hace trabajar horas extra!

source: I'm a born workaholic.
es_419: Soy adicta al trabajo.

source: I still have my housing lottery savings, though...
es_419: Pero aún me quedan los ahorros del sorteo de vivienda…

source: but why did we drink so much last night?
es_419: Pero ¿por qué bebimos tanto anoche?

source: why is he looking at me like that?
es_419: ¿Por qué me mira así?

source: I believed that the current flowing through our late 20s, which looked easy but turned out to be difficult,
es_419: Antes creía que la corriente que fluye cuando te acercas a los 30, que parecía fácil pero resultó ser complicada,

source: back then, I actually wondered for a moment whether I should just stay at iren.
es_419: En ese momento, llegué a dudar por un segundo si quedarme en IREN o no.

source: I don't know if it's just me…
es_419: No sé si solo soy yo…

source: that's…
es_419: Qué…

source: great.
es_419: Genial.

source: to tell you the truth...
es_419: Te diré la verdad…

source: ...I blossomed like a flower...
es_419: … florecí como una rosa…

source: huh...?
es_419: ¿Eh?…

source: Unlike you, I got rich by luck.
es_419: Soy rica de suerte, no como usted.

source: I heard the workload and his method of communication was inhuman.
es_419: Oí que la carga de trabajo y sus formas de comunicarse eran inhumanas.

source: but these two people...
es_419: Pero estas dos personas…

source: please help yourself.
es_419: Sírvete lo que quieras.

source: "it's chae, not choi."
es_419: "Es Chae, no Choi".

source: you're good looking and you're so nice to me!
es_419: ¡Eres apuesto y me tratas muy bien!

source: um, mr. chairman. the thing is--
es_419: Eh, señor presidente. Pasó que…

source: stop
es_419: FRENA

source: I want to know every single thing.
es_419: Quiero saber hasta el último detalle.

source: do you eat like this when your helper isn't around?
es_419: ¿Esto es lo que comes cuando no está el cocinero?

source: Denied.
es_419: Denegado.

source: oh, right! on my way here, I saw ms. gam...
es_419: ¡Ah, sí! Cuando llegué, vi a la señorita Gam…

source: m-mr. chae?
es_419: ¿S-señor Chae?

source: next step.
es_419: Próximo paso.

source: I didn't have a plan or even try to make it go well.
es_419: No tenía nada planeado, ni me esforcé por hacerlo bien.

source: for this past year working together,
es_419: Durante el año que trabajamos juntos,

source: 1. calling his last name incorrectly 2. putting salt in his coffee 3. filling his sandwich with cucumbers instead of pickles
es_419: 1. Decir mal su apellido 2. Ponerle sal en el café 3. Llenarle el sándwich de pepino en vez de pepinillos

source: but that's all, right?
es_419: ¿Pero nada más?

source: right!
es_419: ¡Cierto,

source: what's with the childcare book?
es_419: ¿Qué hay con este libro?

source: that's a good book.
es_419: Es un buen libro.
